#pragma once
/*!
********************************************************
*	@file DialogInsert.h
*	@author Dmitry
*	@date Декабрь  08/12/2022
*	@brief Модуль содержит подключаемые файлы и приватные переменный для интерфейса и методы
**********************************************************
*/
#include <QDialog>

/*!***************************
*
*	@brief Класс DialogInsert	
*	Диалог для вставки
*	@author Dmitry
*	@version 1.0
*	@date Декабрь 08.12.2022
*
*******************************/
class UiDialogInsert : public QDialog
{
	
};
