/*!*****************************************************************************
	@file base.hpp				               
	@author Kuslya A.M.
	@date 2023/05/31
	@copyright Copyright (c) 2023 by Alexander Kuslya <alexander.kuslya@gmail.com>
	@brief ћодуль вспомогательных базовых классов
	
	ћодуль содержит в себе набор вспомагательных классов и структур, которые
	могут быть использованы пользователем дл€ минимизации ручной разработки
	программного кода.
*******************************************************************************/


/** \brief science - Common utilities library */
namespace science {


/*!*****************************************************************************
	@brief ¬спомагательный класс, предназначенный дл€ запрета копировани€
	@author Kuslya A.M.
	@version 1.0
	@date 2023/05/31
	
	ѕри наследовании от класса NonCopyable дл€ всех классов наследников будет
	закрыта возможость использовани€ конструктора копировани€ и оператора 
	копировани€.
*******************************************************************************/
class NonCopyable
{
protected:
	/** \brief  онструктор по-умолчанию */
	NonCopyable() = default;

	/** \brief ƒеструктор по-умолчанию */
	~NonCopyable() = default;

private:
	NonCopyable(NonCopyable const&) = default;
	NonCopyable& operator = (NonCopyable const&) = default;
};



/*!*****************************************************************************
	@brief ¬спомагательный базовый класс дл€ запрета создани€ экземпл€ров
	@author Kuslya A.M.
	@version 1.0
	@date 2023/05/31
	
	ѕри наследовании от класса NonCreatable дл€ всех классов наследников будет
	закрыта возможность создани€ экземпл€ров класса
*******************************************************************************/
class NonCreatable
{
	NonCreatable() = default;
};


} /* namespace science */